Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyWall Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyWall { get; }
Public Shared ReadOnly Property CircularDependencyWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyWall {
	FailureDefinitionId^ get ();
}
static member CircularDependencyWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace